Зарплата_и_Управление_Персоналом_демо/src/Catalogs/БанковскиеСчетаКонтрагентов/БанковскиеСчетаКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчетаКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстНазначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьБанк</name>
    <type>
      <types>CatalogRef.УдалитьБанки</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьБанкДляРасчетов</name>
    <type>
      <types>CatalogRef.УдалитьБанки</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Зарплата_и_Управление_Персоналом_демо/src/InformationRegisters/ОсновныеБанковскиеСчетаКонтрагентов/ОсновныеБанковскиеСчетаКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновныеБанковскиеСчетаКонтрагентов</name>
  <resources>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Зарплата_и_Управление_Персоналом_демо/src/Catalogs/БанковскиеСчетаКонтрагентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляПодчиненногоСправочника(Настройки);
КонецПроцедуры

#КонецОбласти

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ЗаполнитьРеквизитыИзПотребителя.
Процедура ЗаполнитьРеквизитыОбъектаДокументооборота(Прокси, ОбъектXDTO, СсылкаНаПотребитель) Экспорт
	
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
		"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
	
	Если Не (МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMBankAccount")
			И ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.БанковскиеСчетаКонтрагентов")) Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаПотребитель, "Владелец, Банк, НомерСчета");
	
	ОбъектXDTO.number = Реквизиты.НомерСчета;
	
	Если ЗначениеЗаполнено(Реквизиты.Владелец) Тогда
		Если ТипЗнч(Реквизиты.Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
			ТипXDTO = "DMCorrespondent";
		ИначеЕсли ТипЗнч(Реквизиты.Владелец) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ТипXDTO = "DMPrivatePerson";
		КонецЕсли;
		ОбъектXDTO.owner = МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
			Прокси,
			ТипXDTO,
			Реквизиты.Владелец);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Реквизиты.Банк) Тогда
		ОбъектXDTO.bank = МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
			Прокси,
			"DMBank",
			Реквизиты.Банк);
	КонецЕсли;
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриОпределенииЗначенияРеквизитаПоОбъектуXDTO.
Процедура ПриОпределенииЗначенияРеквизитаПоОбъектуXDTO(Результат, ЗначениеЗаполнения, ТипРеквизита, ИмяРеквизита,
		ТипОбъекта, Объект, ЭтоДополнительноеСвойство, Свойство, ПараметрыВыбора) Экспорт
	
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
		"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
	
	Если Не (ТипРеквизита = Тип("СправочникСсылка.БанковскиеСчетаКонтрагентов")
			И ТипЗнч(ЗначениеЗаполнения) = Тип("ОбъектXDTO")
			И ЗначениеЗаполнения.objectId.type = "DMBankAccount"
			И МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СвойствоУстановлено(ЗначениеЗаполнения, "number")) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	МассивТекстЗапроса = Новый Массив;
	МассивТекстЗапроса.Добавить(
		"ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.НомерСчета = &НомерСчета
		|	И НЕ БанковскиеСчета.ПометкаУдаления");
	Запрос.УстановитьПараметр("НомерСчета", ЗначениеЗаполнения.number);
	
	Банк = Неопределено;
	Если МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СвойствоУстановлено(ЗначениеЗаполнения, "bank") Тогда
		Банк = МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗначениеРеквизитаПоОбъектуXDTO(
			ЗначениеЗаполнения.bank,
			Тип("СправочникСсылка.КлассификаторБанков"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Банк) Тогда
		МассивТекстЗапроса.Добавить("И БанковскиеСчета.Банк = &Банк");
		Запрос.УстановитьПараметр("Банк", Банк);
	КонецЕсли;
	
	Владелец = Неопределено;
	Если МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СвойствоУстановлено(ЗначениеЗаполнения, "owner") Тогда
		ТипВладельца = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ТипИС(
			ЗначениеЗаполнения.owner.objectId.type);
		Если ЗначениеЗаполнено(ТипВладельца) Тогда
			Владелец = МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗначениеРеквизитаПоОбъектуXDTO(
				ЗначениеЗаполнения.owner,
				ТипВладельца);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		МассивТекстЗапроса.Добавить("И БанковскиеСчета.Владелец = &Владелец");
		Запрос.УстановитьПараметр("Владелец", Владелец);
	КонецЕсли;
	
	Запрос.Текст = СтрСоединить(МассивТекстЗапроса, Символы.ПС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриСозданииПоСсылке.
Процедура ПриСозданииПоСсылке(ОбъектИС, ОбъектXDTO, ЗаполняемыйОбъектИС) Экспорт
	
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
		"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
	
	Если Не (ОбъектXDTO.objectId.type = "DMBankAccount"
			И ТипЗнч(ОбъектИС) = Тип("СправочникОбъект.БанковскиеСчетаКонтрагентов")) Тогда
		Возврат;
	КонецЕсли;
	
	Если МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СвойствоУстановлено(ОбъектXDTO, "bank") Тогда
		ОбъектИС.Банк = МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗначениеРеквизитаПоОбъектуXDTO(
			ОбъектXDTO.bank,
			Тип("СправочникСсылка.КлассификаторБанков"));
	КонецЕсли;
	
	Если МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СвойствоУстановлено(ОбъектXDTO, "number") Тогда
		ОбъектИС.НомерСчета = ОбъектXDTO.number;
	КонецЕсли;
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ДополнитьСоответствиеТипов.
Процедура ДополнитьСоответствиеТипов(Таблица) Экспорт
	
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
		"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
	
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ДобавитьСтрокуСоответствияТипов(
		Таблица, "DMBankAccount", Тип("СправочникСсылка.БанковскиеСчетаКонтрагентов"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает основной банковский счет контрагента.
//
// Параметры:
//	Контрагент - СправочникСсылка.Контрагенты, СправочникСсылка.ФизическиеЛица - владелец счета.
//
// Возвращаемое значение:
//	ОсновнойБанковскийСчетКонтрагента - СправочникСсылка.БанковскиеСчетаКонтрагентов - основной банковский счет.
//
Функция ОсновнойБанковскийСчетКонтрагента(Контрагент) Экспорт 
	
	ОсновнойБанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента
		|ИЗ
		|	РегистрСведений.ОсновныеБанковскиеСчетаКонтрагентов КАК ОсновныеБанковскиеСчетаКонтрагентов
		|ГДЕ
		|	ОсновныеБанковскиеСчетаКонтрагентов.Контрагент = &Контрагент";

	Результат = Запрос.Выполнить(); 
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			ОсновнойБанковскийСчетКонтрагента = Выборка.БанковскийСчетКонтрагента; 
		КонецЕсли;
	КонецЕсли;
		
	Возврат ОсновнойБанковскийСчетКонтрагента;

КонецФункции

// Формирует временную таблицу, содержащую поля Контрагент, БанковскийСчетКонтрагента, Банк, НомерСчета.
// Банковский счет отбирается по принципам:
//	- Если есть банковский счет указанный как основной - то будет возвращен этот.
//	- Если нет счета, который указан как основной - то один из списка счетов.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц.
//	СписокКонтрагентов		- Массив ссылок на элементы справочников СправочникСсылка.Контрагенты, СправочникСсылка.ФизическиеЛица.
//	Банк					- СправочникСсылка.КлассификаторБанков - банк счета контрагента, если требуется отбор.
//
Процедура СоздатьВТОсновныеБанковскиеСчетаКонтрагентов(МенеджерВременныхТаблиц, СписокКонтрагентов, Банк = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("Банк", Банк);
	Запрос.УстановитьПараметр("БанкЗадан", ЗначениеЗаполнено(Банк));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОсновныеБанковскиеСчетаКонтрагентов.Контрагент КАК Контрагент,
		|	ОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента
		|ПОМЕСТИТЬ ВТБанковскиеСчетаКонтрагентов
		|ИЗ
		|	РегистрСведений.ОсновныеБанковскиеСчетаКонтрагентов КАК ОсновныеБанковскиеСчетаКонтрагентов
		|ГДЕ
		|	ОсновныеБанковскиеСчетаКонтрагентов.Контрагент В(&СписокКонтрагентов)
		|	И ОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка)
		|	И (ОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента.Банк = &Банк
		|			ИЛИ НЕ &БанкЗадан)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТБанковскиеСчетаКонтрагентов.Контрагент КАК Контрагент,
		|	ВТБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента
		|ПОМЕСТИТЬ ВТОсновныеБанковскиеСчета
		|ИЗ
		|	ВТБанковскиеСчетаКонтрагентов КАК ВТБанковскиеСчетаКонтрагентов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БанковскиеСчетаКонтрагентов.Владелец,
		|	МАКСИМУМ(БанковскиеСчетаКонтрагентов.Ссылка)
		|ИЗ
		|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБанковскиеСчетаКонтрагентов КАК ВТБанковскиеСчетаКонтрагентов
		|		ПО БанковскиеСчетаКонтрагентов.Владелец = ВТБанковскиеСчетаКонтрагентов.Контрагент
		|ГДЕ
		|	НЕ БанковскиеСчетаКонтрагентов.ПометкаУдаления
		|	И БанковскиеСчетаКонтрагентов.Владелец В(&СписокКонтрагентов)
		|	И ВТБанковскиеСчетаКонтрагентов.Контрагент ЕСТЬ NULL
		|	И (БанковскиеСчетаКонтрагентов.Банк = &Банк
		|			ИЛИ НЕ &БанкЗадан)
		|
		|СГРУППИРОВАТЬ ПО
		|	БанковскиеСчетаКонтрагентов.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОсновныеБанковскиеСчетаКонтрагентов.Контрагент КАК Контрагент,
		|	ВТОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
		|	ВТОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента.Банк КАК Банк,
		|	ВТОсновныеБанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента.НомерСчета КАК НомерСчета
		|ПОМЕСТИТЬ ВТОсновныеБанковскиеСчетаКонтрагентов
		|ИЗ
		|	ВТОсновныеБанковскиеСчета КАК ВТОсновныеБанковскиеСчетаКонтрагентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТБанковскиеСчетаКонтрагентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОсновныеБанковскиеСчета";
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
